ആവട്ടെ അക്കങ്ങള്‍ = {
  '0': '൦',
  '1': '൧',
  '2': '൨',
  '3': '൩',
  '4': '൪',
  '5': '൫',
  '6': '൬',
  '7': '൭',
  '8': '൮',
  '9': '൯',
}

പ്രയോഗം മലയക്കം (വാക്യം) {
  ആവട്ടെ മാറ്റിയവാക്യം = '',
                അക്ഷരം;
  // കിട്ടിയ വാക്യത്തിലെ ഓരോ അക്ഷരങ്ങളായി  പോവുക
  // ഇത് ഒരു ലൂപ്പാണ്
  ഇന് (ആവട്ടെ സ്ഥാനം ഇല്‍ വാക്യം) {
    അക്ഷരം = വാക്യം[സ്ഥാനം];
    
    // അക്കങ്ങളില്‍ നമ്മള്‍ ഇപ്പൊ നോക്കുന്ന അക്ഷരമുണ്ടെങ്കില്‍
    ആണെങ്കിൽ (എത്തരം അക്കങ്ങള്‍[അക്ഷരം] !== 'undefined') {
      മാറ്റിയവാക്യം += അക്കങ്ങള്‍[അക്ഷരം];
      തുടരുക; // അടുത്ത അക്ഷരത്തിലേക്ക് പൊക്കോ
    }
    മാറ്റിയവാക്യം += അക്ഷരം;
  }
  മടക്കം മാറ്റിയവാക്യം;
}

window.മലയക്കം = മലയക്കം;
window.ഇനക്കം = (വാക്യം) = > {
  
};
